_Rarzrabotki/Kazna/InformationRegisters/СтоимостьАрендыТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>СтоимостьАрендыТехники</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПерегона</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Оборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыУчетаРаботыТехники.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыУчетаРаботыТехники</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Работа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перегон</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/СтоимостьАрендыТехники/Ext/ManagerModule.bsl
Функция ПолучитьЦену(НаДату,Оборудование,ВидУчета) Экспорт 
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст=   "ВЫБРАТЬ
	                |	СтоимостьПродукцииСрезПоследних.Цена,
	                |	СтоимостьПродукцииСрезПоследних.ЦенаПерегона
	                |ИЗ
	                |	РегистрСведений.СтоимостьАрендыТехники.СрезПоследних(&НаДату, ) КАК СтоимостьПродукцииСрезПоследних
	                |ГДЕ
	                |	(СтоимостьПродукцииСрезПоследних.Оборудование = &Оборудование
	                |			ИЛИ СтоимостьПродукцииСрезПоследних.Оборудование = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка))";
	ЗАпрос.УстановитьПараметр("НаДату",НаДату);
	ЗАпрос.УстановитьПараметр("Оборудование",Оборудование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	Если Выборка.Следующий() Тогда
		Если ВидУчета=Перечисления.ВидыУчетаРаботыТехники.Работа Тогда
		
			Цена  = Выборка.Цена;
		Иначе
			Цена  = Выборка.ЦенаПерегона;
		
		КонецЕсли;
		
	Иначе
		Цена=  0;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Цена;
КонецФункции // ()
